#Напишите программу, которая будет преобразовывать десятичное число в двоичное.

num = int(input("Ведите число: "))
bin_num = bin(num) 
print(bin(num))

